[{"url": "/r/7dc077abc7ec751a?sp=0", "parse_status": "2", "content": {"links": ["https://www.facebook.com/tejoram.chamarthi"], "contact_info": "Hyderabad, Telangana-", "headline": "AS400 Technical lLead/ Developer", "resume_title": "AS400 Technical lLead/ Developer", "skills": ["DB2/400 (6 years)", "RPG (4 years)", "SQL (4 years)", "RPGILE (6 years)", "Unix (1 year)", "Core Java (1 year)", "CLLE (4 years)", "CL/400 (2 years)", "SQLRPGLE (4 years)"], "awards": [{"date": "March 2018", "description": "Getting the Star Performer award for adopting the technical challenges in lesser period of time.", "title": "Star Perforformer for the Year 2017-18 from HCL EPS"}, {"date": "February 2017", "description": "Got this award for technical excellence shown and guiding others in module technically and functionally.", "title": "Awarded best performance award from Wipro Fedx for Technical and Functional Contibution"}, {"date": "August 2016", "description": "Got this award for adopting the project situation quickly in both functional and Technical aspects.", "title": "Awarded Best performer from Wipro Fedex for Quick learner"}], "work_experience": [{"company": "HCL Technologies - Hyderabad, Telangana", "work_dates": "April 2017 to Present", "description": "Languages: RPG/LE, CL/LE, SQL400, DB2-400  Project Description: Infor XA is the deepest, most comprehensive and secure ERP product on the market today for discrete manufacturers. This proven solution, now in its fourth generation of technology, draws on 35 years of functional development and industry experience. It offers total information access at the user level, along with embedded social networking, advanced integration architecture, and unmatched simplicity in administration. Based on the IBM Power System platform, Infor XA brings you unparalleled power and flexibility, along with uncompromising reliability and security to deliver 40% lower IT costs Roles & Responsibilities: ➢ Actively participated in the preparation of Business and Technical Design documents ➢ Mentoring the new members in the team to ensure that they are on the track. ➢ Involved in low level design, coding, code review and peer testing. ➢ Fixing the Internal and external bugs and release to the client on time. ➢ Participated in client meetings on Change Requests [CR's]. ➢ Co-ordinate with the SIT team and fixing the code in case of any defects. ➢ Implementing the code in production and providing post-production support for 1 month. ➢ Actively participated in the preparation of Business and Technical Design documents. Got Star performer Award from HCL EPS for current year", "title": "AS400 Technical lLead/ Developer"}, {"company": "Wipro Technologies - Hyderabad, Telangana", "work_dates": "September 2014 to March 2017", "description": "Languages: (SQL) RPG/LE, CL/LE, SQL400, DB2-400, SDA, JAVA400 Project Description: FedEx Ground is one of the FedEx customer services which handle the on road delivery management. Vision System provides all the services for delivering a package from hub to a customer.  Primary Vision Systems includes many applications like RDB Portal (Recipient Database), AMS (Address Management System), Delivery Manifest (DMM), VDS (Vision Data Store) Roles & Responsibilities: ➢ Actively participated in the preparation of Business and Technical Design documents ➢ Mentoring the new members in the team to ensure that they are on the track. ➢ Consolidation of product new updates for the client discussion. ➢ Data preparation for weekly and monthly client status call. ➢ Conducted KT sessions on domain, technical and project related activities ➢ Trained and executed the Next-Gen Delivery process and agile methodologies.", "title": "Senior Project Engineer"}, {"company": "Wipro Technologies - Hyderabad, Telangana", "work_dates": "June 2013 to August 2014", "description": "Languages: RPGLE, SQL, DB2 and UNIX Project Description: FedEx is organized into operating units those are FedEx Services, FedEx Express, FedEx Ground, and FedEx Freight. FedEx application system Support project will support to FXG/FHD/FXSP for their daily routing of package and delivery in smoother way. Roles & Responsibilities: ➢ Involved in incident Management. ➢ Analyzing the issue and fixing the issue on timely basis. ➢ Giving updates to the Customer on Daily scheduled calls. ➢ Assigning Incident to the team and logging the information. ➢ Mentoring the team and providing task updates to the Onsite Lead/Client.", "title": "Software Engineer (Developer)"}, {"company": "Wipro Technologies - Chennai, Tamil Nadu", "work_dates": "September 2012 to May 2013", "description": "Languages: RPG/LE, CL/LE, SQL400, DB2-400 Project Description: E2K revenue management system is Royal Caribbean Cruises Ltd. (Miami, USA) proprietary system. The authorized travel agents of RCCL will be able to use this system to capture and book passenger information for the various cruises. The Pricing and Promotions enables the E2K users to view the various rates available for the bookings and any discounts in form of promotions to be applied on the guest. Roles & Responsibilities: ➢ Involved in database design, coding, code review and peer testing. ➢ Fixing the Internal and external bugs and release to the client on time. ➢ Participated in client meetings on Change Requests [CR's]. ➢ Co-ordinate with the SIT team and fixing the code in case of any defects. ➢ Implementing the code in production and providing post-production support for 1 month.", "title": "Software Engineer"}], "education": [{"school": "BITS Pilani - Hyderabad, Telangana", "title": "M.S. in Software Engineering", "edu_dates": "August 2016"}, {"school": "Padmasri Dr.B.V.Raju Institute of computer Education - Bhimavaram, Andhra Pradesh", "title": "B.Sc. in Mathematics", "edu_dates": "August 2012"}, {"school": "M.P.C Sri Chaitanya Junior college - Bhimavaram, Andhra Pradesh"}], "additional_info": "Areas of Expertise: ➢ Having 5.4 years of IT Experience in Development and Maintenance project in AS400 (CL/LE, RPG/LE, SQLRPG /LE) ➢ Strong Skills in Screen Designing Aid, Data File Utility, Report Layout Utility and Hands-On experience on Data Queues, sub files, Display files. Developed Code in RDi & iSeries Emulator. ➢ Skilled in executing and monitoring Batch Jobs, Implementing source codes through Turnover, Implementer. ➢ Preparing and Executing Test Cases for Unit Testing, System Integration Testing. ➢ 4+ years of experience in Transportation Domain, Less than one year experience in manufacturing domain. ➢ Ideas about software development process (Waterfall, Agile, Iterative) and Software Project Management. ➢ Very Good Knowledge on Agile Methodologies and Implemented Agile using HP Agile Manager. ➢ Having good experience in requirements gathering, designing, developing and delivering the challenging projects. ➢ Collaborates across teams for technical issues and arrives at the best feasible solution. ➢ Performs code reviews: verify extensibility, reusability and assure complexity has been minimized. ➢ Strong organizational and management skills with excellent verbal and written communication and interpersonal skills. ➢ Having Minimal knowledge on Core Java concepts. ➢ Having basic knowledge on Unix Commands. Hardware: IBM AS/400 Operating System: OS400 Database: IBM DB2/400, IBM SQL/400. Scripting Languages: RPG/400, RPGLE, CL/400, CLLE, Core Java. Tools: SDA, DFU, RLU, PDM, SEU, HAWK-EYE, TURNOVER, RDI, HP AGM"}, "html": "html content..", "scrap_status": "2", "_id": "5ad43e66cbc572758d392216"}, {"url": "/r/8523cf070068dc72?sp=0", "parse_status": "2", "content": {"res_summary": "➢ Having 4+ years of experience in the field of information technology with solid experience in Talend data integration(6.4) and Oracle, TAC and  Informatica Power Center, Informatica MDM. ➢ Extensively used components like processing components ( tAggregatorRow, FilterRow, tSampleRow, tFilterColumns, tMap, tjoin, tConvertype, tfilelist, tParallelize, tPostjob, tPrejob, tReplicate, tRunjob, tUnite, tContextload) and log & Errors components ( tDie, tLogRow, tLogCatcher, tStartCatcher), Data Quality Components ( tSchemaComplianceCheck, tUnitRow), custom code components (tJava, tJavaRow, tjavaFlex), File components (tFileinputDelimited, tFileOutputDelimited, tfilieinputExcel, tFileOutputExcel, tifleCopy, tFileDelete, tFileProperties) Database Components (tOracleInput, toracleOutput, tOrafcleCommit, tOracleConnection, toracleTableList) ➢ Implemented scd1 and scd2 dimensionality tables. ➢ Use different functions in tmap for doing transformation logic. ➢ Experience in creating context to use the values throughout the process to pass from parent to child jobs and child to parent jobs. ➢ Experience in creating metadata for different databases and files in talend. ➢ Extensively develop joblets that can be reused in different processes in the flow. Use multi format files like XML, CSV, TXT, son and loading data from these files using talend data integration into relational tables.Handled heap space and memory issues in talend data integration.", "contact_info": "Hyderabad, Telangana-", "skills": ["DATABASES (4 years)", "ETL (3 years)", "EXTRACT, TRANSFORM, AND LOAD (3 years)", "INFORMATICA (2 years)", "Talend with Bigdata (2 years)", "Hadoop (1 year)"], "resume_title": "Senior Software Engineer", "work_experience": [{"company": "AstraZeneca - Hyderabad, Telangana", "work_dates": "June 2017 to October 2017", "description": "Worked for AstraZeneca from June to Oct'2017 ➢ Worked for Capgemini from March'2015 to June'2017 ➢ Worked for CTS from Sep'2013 to jan'2015  Project 1:  Client: AZ Project Name: Aurora Role: Talend Developer  Description: AstraZeneca is a Anglo-Swedish multinational pharmaceutical and biopharmaceutical Company. The company was founded in 1999 through the merger of the Swedish Astra AB and the English Zeneca Group. In 2013, it moved its headquarters to Cambridge, England, and concentrated its R&D in three sites: Cambridge; Gaithersburg, Maryland  Responsibilities:  • Create ETL/Talend jobs to load data into various oracle tables. • Successfully loaded data into different target from various sources systems like Oracle Database, • XML files, Excel files and CSV files. • Performed unit testing and system testing to validate data loads in the target. • Implement custom error handling in Talend jobs. • Experience in creating context group and context variables to run the job against the different environments like Dev, QA and Prod • Using the Joblets to processing the context  variables from joblet to main job. • Creating context variable in main job and applied to child jobs. • Using the tParquet  components loading the data into Blob. • Involved using the database components like tOracleinput, tOracleoutput, tOracleconnection. • Extensively used tmap for joining different sources. • Using SCD1 and SCD2 components to load the current and historical data.  Project2:  Client: Standard Charted Bank Project Name: Schudee Role: Talend Developer  Description: Standard Chartered PLC is a British multinational banking and financial services company headquartered in London, England. It operates a network of more than 1,200 branches and outlets (including subsidiaries, associates and joint ventures) across more than 70 countries and employs around 87,000 people. It is a universal bank with operations in consumer, corporate and institutional banking, and treasury services. Despite its UK base, it does not conduct retail banking in the UK, and around 90% of its profits come from Asia, Africa and the Middle East.  Responsibilities:  • Creating the jobs in talend and loading into the Blob container. • Creating the Stored Procedures and call the job in Talend by unsing the tMssqlsp component. • Creating the Delta and History folders in job level and maintain current and history data. • Fetching the data from different source systems like Excel, Csv, SAP and Salesforce. • Extensively using the Azure components tAzureput, tAzureget, tAzuredelete. • Worked on Tmap, Taggrigaterow, Tsortrow, Tnormalizer, tDenormalizeSortedRow and etc. • Creating Internal and external tables in HIVE environment. • Having good knowledge on Talend parallelization components. • Extensive experience in using Talend features such as context variables. • Creating sub jobs in parallel to maximize the performance and reduce overall job. • Execution time with the use of parallelize component of Talend. • Creating jobs in TAC Dev and publishing the jobs into QA environment. • Scheduling the jobs in Talend TAC tool. • Using Snapshot and Nexus Repository into TAC  Dev and QA environments.  Project3:  Client: CITI Bank Project Name: SMNSData Role: Informatica MDM Developer  Description: Citibank is the consumer division of financial services multinational Citigroup.[2] Citibank was founded in 1812 as the City Bank of New York, later First National City Bank of New York. Citibank provides credit cards, mortgages, personal loans, commercial loans, and the bank has 2649 branches in 19 countries.  Responsibilities:  • Understanding the Business Requirements and Business Functionalities. • Understanding Client requirement from both Technical and Business point of view. • Incorporating new functionalities as requested by the users • Development of new mappings as per requirements considering performance point of view • Using Informatica MDM Hub Console to load data and for monitoring purpose. • Creating mappings and other changes  in Informatica Hub Console to incorporate new functionalities. • Solving incidents raised by client side users regarding performance and usability of MDM system developed by our team for their Organization. • Handling High and Critical priority incidents and communicating all the down streams within the expected timeline • Understand and analyze Informatica MDM Data Model and suggest the changes to meet underlying customer requirements. • To create Informatica MDM  Base Objects, Landing table, Staging table and its corresponding mapping for data load •  Configuring Informatica MDM IDD application by creating proper Subject Area Group, Subject Area & its child and Data  Project4:  Client: Salesforce Project: SFDC Role: Informatica Developer  Description: Salesforce is an American cloud computing company headquartered in San Francisco, California. Though its revenue comes from a customer relationship management (CRM) product, Salesforce also sells commercial applications of social networking through acquisition and internal development. As of early 2016, it is one of the most highly valued American cloud computing companies with a market capitalization above $61 billion.  Responsibilities: • Understanding the Business Requirements and Business Functionalities. • Extracted data from heterogeneous source systems and loaded into the Data Warehouse. • Used Informatica Power Center Designer to create mappings using different transformations like Sequence Generator, Filter, Lookups, Joiner, Update Strategy, Expressions and Aggregator transformations to move data to a Data Warehouse. • Created reusable Mapplets using Mapplet Designer and used them in different code data Mappings. • Worked with Connected look up and unconnected lookup and configured the same for implementing complex logic. • Used mapping variables and mapping parameters in the mappings. • Used SQL override in various transformation like Source Qualifier and Lookup transformation. • Responsible for the performance tuning of the ETL process at source level, target level, mapping level, and session level. • Involved in Unit testing of all the jobs. • Extensively used Debugger for troubleshooting of errors at the mapping level. • Knowledge on UNIX.  Date: Place: Narasimhulu Thota", "title": "Senior Software Engineer"}], "education": [{"school": "Osmania University", "title": "Master 's"}, {"school": "Sri Venkateswara University", "title": "Bachelor's"}], "additional_info": "Technical Skills ETL Tool           Talend data integration Enterprise edition, Informatica Power Center, Informatica MDM. Operating System   Windows […] Languages          SQL, Python Databases          Oracle 10g, SQL Developer and SQL Server Utilities          Putty, Winscp and autosys Scheduling Tool    TAC ( Talend Administration Center) and Autosys"}, "html": "html content..", "scrap_status": "2", "_id": "5ad43e66cbc572758d392217"}, {"url": "/r/8c99f21d0aac85ef?sp=0", "parse_status": "2", "content": {"res_summary": "⇒ Total 13+ years of experience out of which 12+ years of experience in IT Industry in Data Warehousing and Business Intelligence, performing ETL and Data Quality implementation, Data Modeling & Solution Architect for DW / BI for various organizations like Hitachi consulting, Wipro Technologies, Verinon Technology and clienteles like Toyota Financial services, General Mills, Darling International, Valassis, EMNOS, EMMAR, USA technologies, DELL-APAC, UBS. ⇒ Have good knowledge on Hadoop and Hadoop eco-system tools like HDFS, Map Reduce, Sqoop, Flume, Hive, Impala, Pig, Hbase, Spark (Spark Core, Spark Sql, Spark Streaming) ⇒ Experience and knowledge on ETL tools like Informatica Power Center 9.6.1 and OWB10gR2. ⇒ Experience and Knowledge on Data quality tools i.e. Informatica Data Quality ⇒ Good Knowledge on components of OBIEE tool (OBIEE Administration, Answers, Dashboards, IBOTS & BI Publisher) ⇒ Experience and Knowledge on Oracle 10g/11g (PL/SQL) and Postgressql 8.4 (PL/SQL) ⇒ Have good knowledge on OBIA 7.9.6.4 concepts. ⇒ Facilitated various technical training sessions in Hitachi on DWBI tools; Big Data Hadoop & Hadoop ecosystem tools. ⇒ Quick learner & flexible to work on multiple BI tools ⇒ Always proactive to take up new initiatives. Capable of handling multiple things while working on Project like cop initiatives, technical trainings, conducting interviews etc. ⇒ Currently working as Project lead and Technical Architect.  Role is to assist the team on technical issues or clarifications, track daily progress, review team's deliverables, coordinate with onsite team to understand the requirements and accountable for timely and quality deliverables from offshore. ⇒ Experience working on Agile methodology projects and understand the critically of working in Sprint cycles. ⇒ Handled few projects in past by working independently and directly interacting with clients right from requirements gathering, ETL implementation, enhancements, maintenance and production support. ⇒ Oracle Business Intelligence Foundation Suite 11g Certified Implementation Specialist certified (June 12th, 2013) ⇒ PMP certified from PMI (Feb 2nd, 2017) ⇒ Cloudera certified \"CCA 175 Spark and Hadoop Developer\" (Feb 5th, 2018)  Period    Organization s    Roles & Responsibilities March \"2013 - Till date • Hitachi Consulting Software Services  (Formerly Sierra Atlantic)  Manager - DW/BI ETL Implementation, Technical Solution Architect, Data modeling & Pre-Sales Activities, POC's, Client interfacing and onsite / offshore communication.  Aug \"2008 - Oct \"2012 • Hitachi Consulting Software Services (Formerly Sierra Atlantic)  Senior Consultant -DW/ BI ETL Implementation, Technical Solution Architect, Data modeling & Pre-Sales Activities, POC's, Client interfacing and onsite / offshore communication.  March\"2006 -June\"2008    • Wipro Technologies    Project Engineer -DW   Involved in DW ETL development using Informatica Power Center Jan\"2005 - March\"2006 • Verinon Technology Solutions Pvt Ltd.  Software Engineer -DW Involved in DW ETL development using Informatica Power Center  April\"2003- March\"2004   • DELL International Services   Technical Support Representative  Project Implementations  ⇒ Project: HCC AMS, COP BI & Pre-Sales BI Client: Hitachi Internal Projects Duration: June 2017 - Till Date Role: Project lead & Technical Architect - DW / BI Environment: Informatica 9.6.1, OBIEE […] OBIA 7.9.6.4, Oracle 11g Responsibilities: HCC AMS project - • Assist the team on technical issues/clarifications. • Track daily progress of all team members. • Review team's deliverables. • Coordinate with onsite team to understand the requirements. • Accountable for timely and quality deliverables from offshore. • Responsible for deployment activities and release management, that is moving the code to different environments like UAT and Production. • Regular interaction with onsite team (Conf. Calls and Chat session)  COP-BI & Pre-Sales projects - • Track & record the non-project activities efforts of all the BI competency resources • Non-project activities include POCs/Presales/Contribution to technical White papers, blogs, tech talks, solutions showcasing, facilitating technical trainings, conducting technical interviews, developing accelerators. • Approving the non-project activities timesheets • Ensure that all the resources are adhering to the process and entering the efforts correctly without deviating from the outlined standard process.  ⇒ Project: Genesis, Supplier Segmentation & Product Information Management Client: General Mills Duration: Jan 2017 - May 2017 Role: Technical Architect - DW / BI Environment: SAP Data Services, Oracle 11g Pl/Sql, Unix Responsibilities: • Worked  on 3 projects simultaneously for this client Genesis project - • Gathering requirements from various Stakeholders • Providing design approach for various modules • Development and execution of jobs using SAP Data Services. • Responsible for creation of unix shell scripts to load various .csv and .txt files into Oracle database. • Creation & Scheduling of ETL jobs using SAP Data Services and Tidal • Unit testing • Involved in Client interaction during UAT cycles. • Responsible for deployment activities and release management, that is moving the code to different environments like UAT and Production. • Regular interaction with onsite team (Conf. Calls and Chat session)  Supplier Segmentation project - • Gathering requirements from various Stakeholders • Providing design approach • Development and execution of jobs using SAP Data Services. • Creation & Scheduling of ETL jobs using SAP Data Services and Tidal • Unit testing • Responsible for deployment activities and release management, that is moving the code to different environments like UAT and Production. • Regular interaction with onsite team (Conf. Calls and Chat session)  Product Information Management project - • Working on enhancements based on business requirements. • Generation of XML file using Oracle Pl/sql code. XML file generation is based on the product information hierarchy. • Execution of jobs using SAP Data Services. • Unit testing • Regular interaction with onsite team (Conf. Calls and Chat session)  ⇒ Project: Toyota Financial Services Client: Toyota Duration: June 2015 - Dec 2016 Role: Project Lead & Technical Architect - DW / BI Environment: Informatica Power Center 9.6.1, Oracle 11g Responsibilities: • Handled a team of 15 members. • Assisted the team on technical issues/clarifications. • Tracked daily progress of all team members. • Reviewed team's deliverables. • Coordinated with onsite team and client to understand the requirements. • Accountable for timely and quality deliverables from offshore. • Regular interaction with the Client and onsite (Conf. Calls and Chat session)", "contact_info": "Hyderabad, Telangana-", "headline": "Manager - DW/BI - Hitachi Consulting Software Services", "resume_title": "Manager - DW/BI", "skills": ["Business Intelligence (4 years)", "ETL (8 years)", "Informatica (6 years)", "Oracle (8 years)", "OBIEE", "Hive", "Flume", "Sqoop", "Spark"], "work_experience": [{"company": "Hitachi Consulting Software Services", "work_dates": "June 2017 to Present", "description": "• Hitachi Consulting Software Services (Formerly Sierra Atlantic) March 2013 - till Date Project Management, ETL Implementation, Technical Solution Architect, Data modeling & Pre-Sales Activities, POC's, Client interfacing and onsite / offshore communication.  Senior Consultant -DW/ BI  March\"2006 -June\"2008    • Wipro Technologies    Project Engineer -DW   Involved in DW ETL development using Informatica Power Center Jan\"2005 - March\"2006 • Verinon Technology Solutions Pvt Ltd.  Software Engineer -DW Involved in DW ETL development using Informatica Power Center  April\"2003- March\"2004   • DELL International Services   Technical Support Representative  Project Implementations  ⇒ Project: HCC AMS, COP BI & Pre-Sales BI Client: Hitachi Internal Projects Duration: June 2017 - Till Date Role: Project lead & Technical Architect - DW / BI Environment: Informatica 9.6.1, OBIEE 11.1.1.7, OBIA 7.9.6.4, Oracle 11g Responsibilities: HCC AMS project - • Assist the team on technical issues/clarifications. • Track daily progress of all team members. • Review team's deliverables. • Coordinate with onsite team to understand the requirements. • Accountable for timely and quality deliverables from offshore. • Responsible for deployment activities and release management, that is moving the code to different environments like UAT and Production. • Regular interaction with onsite team (Conf. Calls and Chat session)  COP-BI & Pre-Sales projects - • Track & record the non-project activities efforts of all the BI competency resources • Non-project activities include POCs/Presales/Contribution to technical White papers, blogs, tech talks, solutions showcasing, facilitating technical trainings, conducting technical interviews, developing accelerators. • Approving the non-project activities timesheets • Ensure that all the resources are adhering to the process and entering the efforts correctly without deviating from the outlined standard process.  ⇒ Project: Genesis, Supplier Segmentation & Product Information Management", "title": "Manager - DW/BI"}, {"company": "Hitachi Consulting Software Services", "work_dates": "June 2014 to May 2015", "description": "Hitachi Consulting Software Services(Formerly Sierra Atlantic) Aug 2008 - Oct 2012 ETL Implementation, Technical Solution Architect, Data modeling & Pre-Sales Activities, POC's, Client interfacing and onsite / offshore communication.", "title": "Senior Consultant"}, {"company": "Darling International", "work_dates": "March 2013 to April 2014", "description": "Environment: Informatica Data Quality 9.5 Responsibilities: • Worked on DQ mappings to cleanse and standardize business names, address lines, contact information. • Prepared Cleansed/Standardized data for data Matching/DE duplication process. • Match and merge is performed to identify customer golden record. • Using Informatica Power center loaded cleansed data into staging tables and implemented business logic. • Worked on Technical Specification documentation. • Regular interaction with onsite team (Conf. Calls)  ⇒ Project: DOXBI", "title": "Developer - DW / BI"}, {"company": "Valassis", "work_dates": "April 2011 to June 2012", "description": "Environment: Oracle 10g (Pl/sql), UNIX, OBIEE 10.1.3.2 Responsibilities: • Worked independently and directly interacted with the client from start to end of the project. • Attended KT session on existing system and requirements gathering at onsite. • Worked within business line to gather the needs and translated them into a Data Warehouse solution. • Present Technical Solution Architectural Propositions. • Served as the data technical strategy expert and worked on Data Modeling / ETL specifications. • Implemented ETL strategy for both initial and incremental loads using Oracle plsql. • Worked on enhancements based on business requirements. • Worked on tuning plsql code for better performance. • Involved in maintenance and production support. • Involved in Client interaction during UAT cycles. • Regular interaction with the Client (Conf. Calls and Chat session)  ⇒ Project: VRMS", "title": "Developer - DW / BI"}, {"company": "Valassis", "work_dates": "March 2011 to April 2011", "description": "Environment: Oracle 10g (Pl/sql), OBIEE 10.1.3.2 Responsibilities: • Implemented ETL strategy for both initial and incremental loads using Oracle plsql. • Worked on tuning plsql code for better performance. • Worked on tracking the bugs and provided solutions to the team to fix at ETL (Oracle plsql code) and reporting side (OBIEE) • Regular interaction with the Client (Conf. Calls and Chat session)  ⇒ Project: EMNOS Analyzer", "title": "Senior ETL developer"}, {"company": "Emnos", "work_dates": "June 2010 to February 2011", "description": "Environment: OWB 10g, Oracle 10g, Postgres sql (8.4), UNIX, Java Responsibilities: • Conducting workshops with various stakeholders to understand the requirements. • Worked on Data Modeling for new requirements on reporting database. • Extensively worked on plsql code in Postgres sql for reporting database. • Extensively worked on tuning plsql code for better performance. • Perform reviews of work done by others. • Involved in giving demo to the client for signoff before UAT cycles. • Involved in Client interaction during UAT cycles. • Regular interaction with the Client (Conf. Calls and Chat session)  ⇒ Project: EMAAR Customer Hub B2C", "title": "Senior ETL Developer"}, {"company": "Emaar Properties", "work_dates": "November 2009 to May 2010", "description": "Environment: Informatica Data Quality 8.6.2, Informatica Power Center 8.6.1, Informatica Data Explorer 8.6.1, Oracle 10g Responsibilities: • Involved in developing Data Profiling Rules and Reports for Customer data from different Legacy source systems. • Deriving Data Quality rules from the Profiling results for Cleansing and Standardization of Customer Master data. • Creating Data Quality Plans to address the four dimensions of Data Quality namely Completeness, Conformity, Integrity and Consistency. • Identify matching attributes and conform data to matching standards. • Standardize data according to the target Customer Data Hub Model. • Using Informatica Power center to load the legacy system data into staging tables and the cleansed data to Siebel UCM data tables. • Integrate IDQ plans into Power center enabling single view point for the loading and cleansing process. • Involved in Client interaction during UAT cycles (Onsite)  ⇒ Project: ODS", "title": "ETL developer / IDQ Consultant"}, {"company": "USA Technologies", "work_dates": "May 2009 to October 2009", "description": "Environment: OWB 10g, Oracle BIEE, Oracle 10g  Responsibilities: • Designed, validated and deployed ETL mappings using Oracle Warehouse Builder10g R2. • Implemented ETL strategy for both initial and incremental loads. • Implemented Error handling in Oracle Warehouse builder. • Provided performance tuning. • Created Process flows and scheduled based on client requirements. • Performed Unit Testing. • Performed reviews of mappings done by others.  ⇒ Project: Dell Inc. Data Profiling and Cleansing Project", "title": "OWB Developer"}, {"company": "Dell, APAC", "work_dates": "August 2008 to February 2009", "description": "Environment: Informatica Data Explorer 5.0, Oracle 9i (PL/SQL)  Responsibilities: • Understanding Dell's Business. • Performing data analysis. • Executed Informatica IDE over Source data and initiate data cleansing strategy as per the client business requirements. • Data Quality assessment (E.g.: Identifying Data Quality issues with Customer basic/address details, Invoices and Quotations etc.) • Presenting cleansing approach (E.g.: Customer Address Cleansing, Zip code correction, Null verification, Inconsistent/Incomplete data handling etc.) • Converting Business Suggestions into Cleansing Scripts. • Data standardization (E.g.: Identifying and Moving Customer Names, Company Names, Phone, Fax, Email from Address Fields to Appropriate Fields, Zip code correction, Inconsistent/invalid data replaced by default entries as per Business Suggestion) • Execution of Data Cleansing Scripts (PL/SQL Scripts are developed basing on Cleansing Suggestions from Business and executed as an automated process for each business unit.) • Testing (Cleansed data is tested and validated with source data results) • Data Migration using PL/SQL Scripts (Cleansed data is moved to the staging/production environment)  ⇒ Project: CAL (Centralized Accounting Logic)", "title": "Data Profiling Analyst"}, {"company": "Union Bank of Switzerland", "work_dates": "March 2006 to June 2008", "description": "Environment: Informatica Power Center 6.2, Oracle 9i, Windows-XP, Toad 8.6, Rational Clear Case, Putty, VJG, AUTOSYS  Responsibilities: • Designed, validated and executed ETL mappings using Informatica Power Center 6.2. • Created necessary configuration entries & autosys jobs which are required to be promoted along with the code to other environments. • Performed Unit Testing. • Prepared Unit Test Plan Documents. • Created batches to schedule them in production for running mappings. • Performed reviews of mappings done by others. • Followed up with the promotions from Dev to TST, PSP & PROD environments after getting user signoff. • Resolved issues during TST & PSP promotions, UAT cycles & Production. •  Interacted with the Client while implementing in Production (Conf. Calls and Chat session)  ⇒ Project: Advance America", "title": "ETL Developer"}, {"company": "Advance America", "work_dates": "January 2005 to March 2006", "description": "Environment: Informatica Power Center 7.1, Business Objects 6.5.1, Oracle 9i, Windows NT  Responsibilities: • Involved in analyzing the data model and Identification of heterogeneous data sources. • Designed, validated and executed ETL mappings using Informatica Power Center 7.1. • Tuned mappings for Optimum performance, Dependencies and Batch Design. • Involved in creation and usage of stored procedures and loading of data into data marts using Informatica power center on Monthly basis. • Running sessions and workflow to load the data.  Educational Qualification & Certifications ⇒ MSc (Computer Science) - Osmania University, India from June 2000 to June 2002 ⇒ Oracle Business Intelligence Foundation Suite 11g Certified Implementation Specialist, June 12th, 2013. ⇒ PMP Certified Feb 2nd, 2017. ⇒ Cloudera certified \"CCA 175 Spark and Hadoop Developer\" Feb 5th, 2018.", "title": "ETL Developer"}], "education": [{"school": "Osmania University", "title": "MSc in Computer Science"}], "additional_info": "Primary Skills   Project Management, ETL implementation, Data Modeling & DW/BI Solution Architect, Facilitating Technical Training Technical Skills  / Products worked  • ETL tools -- Informatica Power Center 9.6.1, OWB10g, SAP HANA BI Implementation, SAP Data Services. • Data quality - Informatica Data Quality • Reporting tools - OBIEE 10g/11g (OBIEE Administration, Answers, Dashboards, IBOTS & BI Publisher), Crystal Reports, OBIA 7.9.6.4 • Databases - Oracle […] (PL/SQL) and Postgressql 8.4 (PL/SQL), SQL Server  Domain / Verticals worked • Financial Services • Banking • Marketing Services • Strategy and Consulting • Properties • Retail"}, "html": "html content..", "scrap_status": "2", "_id": "5ad43e66cbc572758d392218"}, {"url": "/r/0be5531ae3179863?sp=0", "parse_status": "2", "content": {"res_summary": "•  Having 2.11 years of experience in development of Server/Client side Programming and Front-End development by using all Java API and related technologies. • Good Experience in Developing Applications using JAVA/J2EE technologies like Collections, Exception, JDBC, JSP, and Servlets. • Knowledge in Spring Framework (MVC & core) & Hibernate Framework and JPA • Excellent commitment, dedication and planning towards goal oriented tasks. • Strong analytical and problem-solving skills with good interpersonal and communication skills. • Easy learning and flexible to work on different kinds of Technologies. • Self-motivated and quick learner of new concepts and technologies.", "contact_info": "Hyderabad, Telangana-", "headline": "software Developer - NAPIER HEALTH CARE SOLUTIONS", "resume_title": "Software Engineer", "skills": ["springs", "jpa", "hibernate", "servlets", "ajax", "html", "bootstrap", "Java", "jsp", "jquery", "jquery"], "work_experience": [{"company": "Ami Tech (India) Pvt. Ltd - Hyderabad, Telangana", "work_dates": "August 2017 to Present", "title": "Software Engineer"}, {"company": "NAPIER HEALTH CARE SOLUTIONS", "work_dates": "April 2017 to Present", "description": "PRIL 2017 To 31-July 2017 as a Contract • Worked  as a Software Developer in VSAP TECHNOLOGIES  from 2-April  2015 to 12- April 2017.  Personal Traits: • Curious to learn • Positive attitude and Leadership qualities • Honest, Responsible and hardworking • Willingness to walk the extra mile to achieve excellence.", "title": "software Developer"}], "education": [{"school": "JNTU", "title": "B.tech in engineering"}, {"school": "LionsClub School Hyderabad - Hyderabad, Telangana", "title": "SSC"}], "additional_info": "Technical Skills: Skill                            Experience                        Knowledge on Programming Languages            Java                              C, C++ Web Technologies (Client Side)   HTML, JavaScript, CSS, Bootstrap   AJAX, JQuery, J2EETechnologies                 Servlets, JSP, JDBC. Frameworks                       Springs, Hibernate, JPA           Springs, Hibernate, JPA Web/App Servers                  Tomcat IDE's                            Eclipse, Netbeans                  NetBeans Database                         MySQL, SqlServer                  oracle Operating System                 Windows XP/7/8/10  Projects Profile:  Project 1#                           KnitApp Period May  2015  to December 2016  Description: The KNIT APP Project developed to provide the services to the users who are registered with this application. We can use this application for the apartments, different societies, different categories of community too. The main aim of this project is to provide all types of associated services to the users who are registered in with the particular apartment or societies. Responsibilities: • I worked with Java, JSP, Servlet, and Ajax in application tier. • Handled entire retailer module It sends Points To users • Designing the Structure in Spring MVC model. • Involved in Designing Databases. • Interaction with client side coordinator for clarifications and status reporting.  Role         Java Developer Team Size    4 Technology   JavaSE, J2EE, JSP, Servlet, Ajax, Hibernate, HTML, JavaScript, Tomcat.  Project 2#                  GVK Trip expences Period January 2016- April  2016.  Description: This trip expenses  Provides the complete details of a person. This Application used for an organization .We can track the location as well as we can check all the bill amount uploaded in the particular location in A Map view..To avoid duplicate bills. Responsibilities: • Involved in Client interaction on regular basis to understand the Business of the Client. • Involved in the Analysis, Design, Coding, modification and implementation of user requirements in the Order History application. • Developed Spring MVC Structure. Designed the Databases. • Worked on the report generation part for user as well as admin. • Worked on Scripting Code.  Role         Developer Team Size    4 Technology   JavaSE, JSP, Servlet, Ajax   Tomcat, Spring MVC.  Project 3#                           SPY GUARDS Period may 2016 to August 2016  Description: SPY GUARDS: spyguards Software which is related to all the Society and Group Of ventures..here we can capture the visitors Details and uploaded to server through this application.. we can trace out the person  who are unknown visitors through conformation from the security guards to Owner.. Responsibilities: • Creating Databases. • Involved in Developing the Modules like ExistingVisitors, Exitvisitors  and generating Report. • Involved in Analysis and Coding part of this application  worked in Spring Related controllers.  Client       Aparna Constructions. Role         Java Developer Team Size    2 Technology   JavaSE, JSP, Servlet, Ajax   Tomcat, Spring MVC.  Project 5#                           Nursing Home Solutions Period April  2017 to august 2017  Description: NHS: Main Aim of this PRODUCT is to Book Appointments For Oldage homes & nursing homes, and nursing activities, Reports, Orders, etc Modules are involved in this product. Responsibilities: • Creating Tables in Database • Involved in Developing the Modules like, Transport, Orders, ApointmentsBooking  ETC  Client       Internal Product   NAPIER HEALTHCARE Role         Java Developer Team Size    20 Technology   SpringMVC, Hibernate, Jpa, Bootstrap, css  Project 6#                           MDAS (Meter Data Acquisition System) Period August 2017 to Present  Description: MDAS: Main Aim of this PRODUCT is to read the meter Data and generating monthly bills and it display all the meters in the substations are communicating status and generating INSTANTANIOUS DATA, ENERGIES, LOADSURVEY, TAMPERS.  Based on meter number we can get the MeterData. Responsibilities: • Creating Databases. • Maintaining MDAS application of BOPAL, MSETCL (Maharastra), Jarkhand • Involved in Developing Modules like, Bill generation, Reports ETC  Client      Internal Product   Of AMI Tech india pvt ltd Role        Java Developer Team Size   8 Technology servlets, java oops Hibernate, Bootstrap, css, Jquery Ajax"}, "html": "html content..", "scrap_status": "2", "_id": "5ad43e66cbc572758d392219"}, {"url": "/r/d2fa964bae830082?sp=0", "parse_status": "2", "content": {"headline": "Sr. DataStage Developer - BLUECROSS BLUESHIELD OF TENNESSEE", "resume_title": "Sr. DataStage Developer", "res_summary": "• 8+ Years of IT experience with special emphasis on System Analysis, Design, Development, Testing and implementation of Data Warehousing, Data Integration and Data Migration using IBM Info sphere DataStage (IIS) v11.3 or 9.1 or 8.5.3 (Parallel), and its foundation tools such as Oracle 11g, PL/SQL, DB2, and Sequential Files and UNIX Shell Scripting. • Extensive experience in developing strategies for Extraction, Transformation, loading (ETL) data from various sources into Data Warehouse and Data Marts using Accentual Data Stage client tools like DataStage Designer, DataStage Director and DataStage Administrator, Quality Stage, Information server and Parallel Extender. • Experience with different flavors of RDBMS (DB2, Oracle, etc.) . Good knowledge of Maintenance, enhance, and optimizing DataStage jobs. • Strong knowledge of relational and dimensional database concepts. Expert in Data Warehousing techniques for Data Cleansing, Slowly Changing Dimension phenomenon (SCD), Surrogate key assignment and CDC (Change Data Capture) • Strong understanding of the principles of DW using Fact Tables, Dimension Tables, Star and Snowflake schema modeling. • Experience in using various stages like ODBC, Transformer, Sequential file, Hashed file, Join, Aggregator, Merge, Join, Lookup, sort, Copy, remove duplicate, Funnel, Filter, Pivot, Switch, Modify, Dataset, Oracle, DB2 Stage, shared containers, Teradata Stage (Multiload, Fast Load, Tpump) for developing jobs. • Involved in complete Software Development life-cycle (SDLC) of various projects, including requirements gathering, system designing, data modeling, ETL. • Worked and extracted data from various data sources such as Oracle, MS-SQL Server, MS- Access, Teradata, DB2, XML and Flat files. • Experience in using Quality stage with investigate, standardize, match frequency and survive. • Experienced in Extraction, Cleansing, Integration, and Loading of data from/to various data sources. • Experience in Designing, Compiling, Testing, and Scheduling and Running Data Stage jobs. • Knowledge in using PL/SQL to write stored procedures, functions, and triggers. • Experience with developing both server and parallel jobs running on a UNIX platform against relational databases such as Oracle, SQL Server systems as source and target data environments. • Designed Mapping documents ETL architecture documents and specifications. • Excellent communication skills, Good organizational skills, Self-starter and motivated, hardworking, ability to work independently or cooperatively in a fast paced and challenging business environment, ability to learn new development environments quickly.", "work_experience": [{"company": "BLUECROSS BLUESHIELD OF TENNESSEE - Houston, TX", "work_dates": "October 2016 to Present", "description": "BCBST are an independent, not-for-profit, locally governed health plan company. For more than 60 years, BlueCross BlueShield of Tennessee has been centered on the health and well-being of Tennesseans. Today, more than 2 million people across the state turn to us for health plan coverage and insurance products. And more than 5 million people nationwide benefit from the services we provide.  Responsibilities: • Worked with Business Analyst for requirements gathering, Logical Design, Physical Design model meetings to understand the data flow, frequency of data loads. • Involved in Defined Best practice doc, Development standards doc for DataStage Jobs. • Extensive experience in handling and creating In-bound and Out-bound files from legacy systems. • Designed IBM info sphere parallel jobs using stages such as Join, Merge, Lookup, Remove Duplicates, Copy, Filter, Funnel, Dataset, Lookup, Pivot, and Sort, Surrogate key Generator, Change Data Capture (CDC), Modify, Row Generator and Aggregator. • Created complex sequencer to handle ABC (Audit Balancing Check) for 550 Database objects. • Worked with Functional team and Data Modelers/Architects to identify and understand the data from different source systems. • We using Quality stage with investigate, standardize, match frequency and survive. • Handling of production DataStage jobs using ESP Scheduler. • Imported assets into the Information Server Repository using Metadata asset manager. • Extensively used Connector Migration Tool for conversion project. • Involved in DataStage 9.1 Prototype project. • Used configuration management tools like ClearCase and Clear Quest for Version Control System. Environment: IBM Infosphere DataStage 7.2/7.5/8.0/8.5/9.1/11.1 (Parallel Extender), Teradata 12.0/13.11, DB2 UDB/ZOS 8.x/7.x, BTEQ, TPT, SQL, Shell Scripts, Mainframe, ESP CA Work Station 11.3, IBM Rational (ClearQuest & ClearCase) 7.0, AIX 5.2/6.0, Windows XP", "title": "Sr. DataStage Developer"}, {"company": "Macys.com - San Francisco, CA", "work_dates": "March 2015 to September 2016", "description": "Project: MCOM_REGISTRY_AFFLIATES Project Related to Tracking of Registry creations and marketing initiative program. Macys Registry internal and Wedding Channel becoming an affiliate partner, Macys like to extend the Affiliate Marketing Program by tracking Registry Creations as well as Registry Sales and Returns referred by Wedding Channel. Furthermore, Macys plan to support MCOM marketing initiatives by providing MCOM Site customer profile subscriptions, Site Registry subscriptions, and Fed Gift Registry subscription feeds to Cheetah Mail.  Responsibilities: • Involved with Technical Business Analysts to understand the Business Requirement Specifications and implemented the ETL jobs using DataStage. • Extensively used Datastage Designer to Develop the Parallel Jobs. • Developed various Jobs using Designer stages like Join, Lookup, Transformer, Copy, Sort Remove duplicate, Sort, Filter, Aggregator, Funnel stages. • Developed parameter driven ETL process to map source systems to Target data systems with DataStage complete source system profiling. • Developed sequencers to control the job execution of the Datastage Jobs. • Implemented various partition methods like Hash, Entire, Auto, db2. • Dealt with various Database stages like DB2/UDB, ODBC. • Extensively used SQL to Extract the Data from the History tables to improve the performance. • Involved in developing the shell scripts to create indexes, Drop the indexes on the Tables, FTP Processes and enhanced the master script to run the master sequencer. • Performed the Unit Testing for Jobs Developed to ensure that it meets the Requirements. • Involved in migration of Datastage code to the Integration and Production, participated in Integration testing. • Moved the ETL Jobs from Integration to Production. Environment: IBM Data stage v 8.0.1, DB2/AIX64 9.5.4, Microsoft xp2002, IBM AIX 5.3, Db2 command editor.", "title": "Sr. DataStage Developer"}, {"company": "Kaiser Permanente - Oakland, CA", "work_dates": "April 2014 to February 2015", "description": "Project: Kaiser ensures quality of healthcare insurance by embracing the latest standards of insurance, deploying evidence-based models and managing treatment and diagnosis to achieve the best possible outcomes. Responsibilities: • Working with both onsite and offshore team of ETL Developers and ETL Analyst. • Involving with business users for identifying, prioritizing & resolving numerous data issues, create ETL Project Plans, design and development • Handling both development and support teams. • Simplifying the environment by removing redundant objects. • Automated the processes to reduce the manual efforts. • Involved in data profiling and data model. • Developed a complex SQL code to use in the common code approach to avoid writing several SQL scripts for different source table/file formats. • Preparation of technical specification for the development of Extraction, Transformation and Loading (ETL) jobs to load data into various tables in Data marts. • Worked with DataStage server stages like OCI, ODBC, Transformer, Hash file, Sequential file, Aggregator, Sort, Merge, Link Partitioner, Link collector, IPC and other stages. • Implemented and hardcoded high performance DataStage routines. • Imported the required Metadata from heterogeneous sources at the project level. • Used Parallel stages like Lookup, Join and Merge stages for joining various information and also used Parallel Transformer, Column Generator, Funnel, Filter, Switch, Modify, Pivot, Row Generator. • Used Parallel Extender Development/Debugging stages like Row generator, Column Generator, Head, Tail and Peek for debugging of the jobs. • Performed debugging on these jobs using Peek stage by outputting the data to Job Log or a stage. • Developed Job Sequencer to execute jobs in proper sequence. Also automated email messaging was implemented using Sequencer to notify the operations team of any data load issues such as job failure, dropped rows, rejected rows etc. Environment: Windows 2008, IBM Data stage 8.5 Server/parallel/8.1/8.0/7.5/7.0 (Administrator Client, Manager, Designer Client, Director Client), Parallel Extender, Information Analyzer (IA), Oracle 11g, SQL Server 2008R2, SQL, and AIX/UNIX.", "title": "DataStage Developer"}, {"company": "USAA - San Antonio, TX", "work_dates": "July 2013 to March 2014", "description": "Project: The United Services Automobile Association (USAA) is a Texas-based Fortune 500 diversified financial services group of companies including a Texas Department of Insurance regulated reciprocal inter insurance exchange and subsidiaries offering banking, investing, and insurance to people and families that serve, or served, in the United States military. At the end of 2013, there were 10.1 million members.  Responsibilities: • Expertise in designing and implementing DataStage Architecture in data warehousing and Business Intelligence projects. • Worked with Functional team and Data Modelers/Architects to identify and understand the data from different source systems. • Involved in the Analysis of the functional side of the project by interacting with functional experts to design and write technical specifications. • Worked on the Architecture of ETL process. • Created DataStage jobs (ETL Process) for populating the data into the Data warehouse constantly from different source systems like ODS, flat files, scheduled the same using DataStage Sequencer for SI testing. • Extracted data from sources like Oracle and Flat Files. • Preparing development timing plans & reporting to senior management about the supplier progress system & ensuring their engineering support for onsite integration & production launch. • Working in a team with other associate product & component developers. • Analyzing & Designing. • Involved in Quality Assurance, Unit Testing and Integration Testing to test jobs and also the system process flow. • Worked on changed requests as per clients and projects technical specification needs. • Awareness about the functional/business aspects for the components. • Automated process of job monitoring which helped in minimizing the manual intervention & documenting them perfectly. • Provide support for monthly/weekly batches in production run. • Involved in the Documentation of the ETL phase of the project. • Developed the reusable components, best practices that were later on used in other Data warehouse. Environment: Data Stage 9.X, DB2, Oracle 11g, UNIX, MICROSOFT VISIO, Control-M, SQL plus, Win CVS.", "title": "ETL DataStage Developer"}, {"company": "Wells Fargo - Charlotte, NC", "work_dates": "November 2011 to July 2013", "description": "Project: Wells Fargo is engaged in Financial Services and Banking. Project aim is to migrate data to Oracle data warehouse. There are source systems, which extracted data and integrated and loaded into the target warehouse tables and data mart tables.  Responsibilities: • Part of design team and production Support team for the migration project. Part of a design team for design of STAR schema for data warehouse project. • Interacted with the End users / Customers for Creating Mapping documents. Created Mapping documents for Migration project. • Done extensive business analysis to analyze the source system and talking to the business groups to understand the reporting requirements. • Designed the mapping documents between source databases and target databases. • Designed and developed Customer mart and Sales mart using the data from the centralized data warehouse using top-down approach. • Worked on critical Occurs and Redefines in the complex flat file structures. Done data analysis, quality analysis, and data loading. • Developing processes for extracting, cleansing, transforming, integrating and loading data into databases. • Created extract processes, analyzing the data, DB2 code to pull the required data. • Developed many DataStage server jobs for data processing and loading of data. Developed Load jobs Oracle and DB2databases. • Used TOAD tool for the analysis part. Used AutoSys for Scheduling of the Jobs. Environment: IBM Info Sphere DataStage 8.5 (Manager, Designer, Director, Administrator), Oracle 10g, DB2 UDB, SQL, PL/SQL, Lotus Notes, Toad, SQL * Loader, UNIX, AutoSys, Windows XP/NT, Erwin 3.5", "title": "Datastage/ETL Analyst"}, {"company": "Virtusa - Hyderabad, Telangana", "work_dates": "January 2009 to October 2011", "title": "SQL BI Consultant"}], "contact_info": "Green Bay, WI-"}, "html": "html content..", "scrap_status": "2", "_id": "5ad43e66cbc572758d39221a"}, {"url": "/r/fc9fd444e2c2b8f1?sp=0", "parse_status": "2", "content": {"res_summary": "• 7 years of experience in Web GIS development  • Certified ScrumMaster®  • Excellent communication and interpersonal skills. • Working knowledge of Open Source GIS, and ESRI technology.", "contact_info": "Hyderabad, Telangana-", "headline": "Sr.GIS Developer - Avineon India Pvt Ltd", "resume_title": "Sr.GIS Developer", "skills": ["GIS (8 years)", "API (4 years)", "JAVASCRIPT (3 years)", "ARCGIS (2 years)", "HTML5 (1 year)"], "work_experience": [{"company": "Avineon India Pvt Ltd", "work_dates": "July 2017 to Present", "title": "Sr.GIS Developer"}, {"company": "Avineon India Pvt Ltd", "work_dates": "July 2017 to Present", "description": "Technologies Used   ArcGIS JavaScript 4.x Description The project involves Research and development for all the functionalities which can be achieved using 3D. The project has all data related to BIM model. The basic objective of the project is to prepare a prototype creation which allows the user to use basic functionalities and as per user demand further development has been performed on it.  2. Wipro Limited"}, {"company": "One Map", "work_dates": "August 2016 to July 2017", "description": "Technologies Used   ArcGIS Server 10.4, ArcGIS Online, ArcGIS Portal Description One Map Portal is a GIS portal which allows BP to create and share its maps to its different regions. The portal has data published via ArcGIS Server which is federated with ArcGIS Portal thus allowing users access all the data in the Portal. Users have a set of template which they can use to publish the data for its regions. Our role is to provide configuration support to his portal and do necessary changes with respect to widgets as requested."}, {"company": "Wipro Limited", "work_dates": "November 2014 to June 2017", "title": "Sr.GIS Developer"}, {"company": "Shell Maps", "work_dates": "April 2015 to July 2016", "description": "Technology Used   ESRI JavaScript API 3.14 Description It's a small module in the portal for Shell. The module is HTML5 compatible.  Map allows users to check the details of all the wells Shell is having around the globe. User is having a number of layer to switch on and off to check various layers. User can put the name of any well and view it on the map with the result displayed in grid. User can transfer these details on to the portal.The application allows the search from the portal to be viewed on map and vice versa. User can perform spatial intersection i.e assets within any polygon, search the wells and perform spatial query on maps.  3. Wipro Arabia"}, {"company": "Flight Watch", "work_dates": "December 2014 to April 2015", "description": "Technology Used   GeoServer, Open Layers, Oracle, PostGIS Description The System has complete coverage of flight operations processes from Schedule Management, Fleet Management, Long Term Planning and Dispatch & Mission Control System provides Tabular View for Flights Schedule, Map to View Enroute Flights, Track and View path traversed by the flight with respect to the Planned Values (which includes Position, Time, Fuel, Speed and Altitude) . It has an excellent alerting mechanism revolving around the crucial parameters Position, Time, Fuel, Speed and Altitude which are very important for a Flight while it progresses from Origin to the Destination. The system has option to Overlay different Layers to Filter the results. The System is an integrated, feature rich, user friendly and intelligent  application which provides high levels of automation and optimization,  providing the users with more time to 'analyze & evaluate' multiple solutions, taking into account multiple cost factors across the business as well as operational impact, ultimately resulting in increased revenue and operational stability  4.  MagnaSoft GeoSpatial Project Name      Vehicle Tracking Duration          Jan 2014 - Nov 2014 Technology Used   PHP, Postgresql, JavaScript, Google Maps API, HTML5 Description The application is meant for live tracking of the vehicles used in mines.GPS have been fitted in the vehicles which keep on transmitting data which is stored in postgres.From the data base the maps are connected which plot the live status of vehicles using Google maps API and various reports are getting generated.The front end was developed using PHP and HTML5  5. India Urban Space Foundation Project Name      IchangemyCity"}, {"company": "Magnasoft Geospatial", "work_dates": "January 2014 to November 2014", "title": "Sr.GIS Developer"}, {"company": "India Urban Space Foundation", "work_dates": "September 2012 to September 2013", "title": "GIS Developer"}, {"company": "GeoJSON", "work_dates": "September 2012 to September 2013", "description": "Technology Used   ArcGIS Server, Google Map API, ESRI Javascript API, GeoJSON Description iChangeMyCity is a GIS based portal which uses Google map as a base map and custom layers publish on ESRI's ArcGIS Server/Geoserver. This provides following facilities to the public: • Mark the complaints based on their geographical locations using map. • Calculating the rating of wards based on their geographical areas. • Providing land use and land cover details of the city based with context to geographical area. • Facility to search MP, MLA, Corporator, and Civic Agencies. • Allow users to add complaint/visualize complaints about the Urban problem of the city based on Geo location.  6. RSI Softech India Pvt Ltd."}, {"company": "Aditya Kumar", "work_dates": "2013 to 2013", "description": "Mobile: +919663621030 Adityakumar529@outlook.com"}, {"company": "RSI Softech Pvt Ltd - Hyderabad, Telangana", "work_dates": "June 2010 to September 2012", "description": "Poster/Presentation Presentation on \"Harnessing the potential of crowd sourcing for geospatial inventorying in           disaster response using Open source geospatial tool\" at India Geospatial Forum Hyderabad,", "title": "GIS Developer"}, {"company": "Bhuvan", "work_dates": "June 2010 to September 2012", "description": "Technology Used   Open Source GIS technology (Open Layers API, Geoserver, Postgres, QGIS, GeoWebCache) Description Bhuvan is the India Geo Portal of Indian Space Research Organization (ISRO/NRSC) .The application allows the user different raster/vector layers for the country in 2D/3D.The web applications allows different vector and raster data for India ranging from state, district, taluk, village level information.It also shares real   time climate data, fishing information data, landuse data etc.The entire application has been developed using Open Source technology i.e Open Layersers, GeoServer, Postgresql/PotsGIS"}], "education": [{"school": "Symbiosis International University", "title": "M.Sc in Geoinformatics", "edu_dates": "October 2008"}, {"school": "Sambalpur University - Sambalpur, Orissa", "title": "B.Sc in Computer Science", "edu_dates": "August 2005"}], "additional_info": "Technical Skills  RDBMS  Client Technologies Introduced  Web Technologies  GIS Software/Languages  : Postgresql/PostGIS : HTML5, JavaScript, GeoJSON : HTML5, JavaScript  : ArcGIS Server 10.x, Arcgis JavaScript API 3.x/4.x, Python, Portal  For ArcGIS"}, "html": "html content..", "scrap_status": "2", "_id": "5ad43e66cbc572758d39221b"}, {"url": "/r/06f1201e8a3b35c5?sp=0", "parse_status": "2", "content": {"res_summary": "✓ Having 11 Months of Professional Software    Development Experience. ✓ Having hands on developing experience in HTML, CSS, WORDPRESS. ✓ Provided production warranty support and transferred knowledge to client support team. ✓ Good working knowledge on application development, support and maintenance. ✓ Self-Motivated, work well with team environments and also individual. ✓ Possess ability to learn quickly and rapidly add value to projects.", "contact_info": "Hyderabad, Telangana-", "headline": "Word press Developer - DSQUARE TECH LABS Pvt. Ltd", "resume_title": "Word press Developer", "skills": ["Wordpress (Less than 1 year)", "BOOTSTRAP (Less than 1 year)", "CMS (Less than 1 year)", "CONTENT MANAGEMENT SYSTEM (Less than 1 year)", "CSS (Less than 1 year)"], "work_experience": [{"company": "DSQUARE TECH LABS Pvt. Ltd - Hyderabad, Telangana", "work_dates": "August 2017 to Present", "description": "Project: Title: HCL Global System Site: http://hclglobal.com/ Technologies: Word press 4.5 Plugins: Js-Composer (Visual), Page-Builder, Revolution Slider, Theme: Impreza Description: HCL Global Systems is one of the best IT consulting firm specialized in Application development, Quality Testing, IT Courses Training, staffing and recruitment services. With wide range of experience, we are confident in our ability to help our customers grow and improve their businesses. More than likely, regardless of the nature and scope of the problem, our dedicated team of professionals can help you to achieve a cost effective business solution.", "title": "Word press Developer"}], "education": [{"school": "Medak College of Engineering and Technology - Medak, Andhra Pradesh", "title": "B.Tech in ECE", "edu_dates": "2012 to 2016"}, {"school": "Board of Intermediate Education - Kurnool, A.P, IN", "title": "Mathematics, Physics, Chemistry", "edu_dates": "2011 to 2012"}, {"school": "Board of Secondary Education", "title": "SSC in Mathematics", "edu_dates": "2010"}], "additional_info": "Technical Skills: • AMP Package: XAMPP, WAMP • Intermediate Skills: HTML, CSS, JavaScript, Bootstrap, Word press,  • Operating Systems: DOS, Windows • CMS: Word Press 4.9.4  Positive Aspects:  ➢ Ability to adopt and learn new technologies ➢ A highly motivated, energetic individual in the team ➢ Ability to influence people and get along with everybody.  Strengths:  ➢ Disciplined ➢ Positive Attitude ➢ Curious ➢ Open-Mindedness  Roles & Responsibilities:  ➢ Developed Web Application, System Designing & Architecture, New Component Development. ➢ Modification and Customization on existing CMS. ➢ Troubleshooting and resolving the issues. ➢ System design, Prototyping, Developing new creative modules and deployment. ➢ Interact with Clients. ➢ Mentor for Trainee."}, "html": "html content..", "scrap_status": "2", "_id": "5ad43e66cbc572758d39221c"}, {"url": "/r/972c661b6313629d?sp=0", "parse_status": "2", "content": {"contact_info": "Hyderabad, Telangana-", "headline": "Freelance Web Developer", "resume_title": "Freelance Web Developer", "skills": ["Php (9 years)", "MySQL (9 years)", "UNIX (7 years)", "Kohana (5 years)", "Joomla (2 years)", "CakePHP (1 year)", "Symfony (1 year)", "OctoberCMS (1 year)", "Jquery (5 years)", "ExtJS (2 years)"], "work_experience": [{"company": "Netosting Technologies Pvt Ltd - Coimbatore, Tamil Nadu", "work_dates": "January 2009 to Present", "description": "•    Using latest version of Kohana, set up https://www.goclouds.com/, site catering to purchase domain names, server space, SSL certificate etc. •    Worked on setting up efficient backend for various emailers sent out for telecom customers Airtel and Vodafone. •    Developed EXTJS AJAX based website - http://orbit.nettxt.in/login  for bulk messaging using multiple SMS providers. •    Added enhancements on event based and educational  websites that required database support. •    Set up applications  for internal purposes.", "title": "Freelance Web Developer"}, {"company": "Themobilizers - Dubai", "work_dates": "January 2014 to May 2017", "description": "•    Created and mainatined project timelines. •    Followed up with outsourced developers in task tracking. •    Assisted in QA and testing of project deliverables. •    Assisted in organization and creation of functional and technical specification documents. •    Integrated workshop outputs into project scope statments. •    Products worked on: https://www.nestledessertsarabia.com/, Nestle Arabia Desserts mobile app(IOS & Android), http://www.tefal.com/pots-pans-expertise, https://www.pickyeatersarabia.com/en/", "title": "Junior Project Manager (Remote)"}, {"company": "The Storage Bed Company - Nottingham, Nottinghamshire", "work_dates": "November 2010 to October 2011", "description": "•    Added enhancements and made fixes on thestoragebed.com(now http://www.furl.co.uk/storage-beds/)  that caters to online ordering of storage beds. •    Developed  and designed the ordering system  of thesofabed.com (now http://www.furl.co.uk/sofa-beds/) that caters to online delivery of sofabeds.", "title": "Freelance Kohana Developer"}, {"company": "ITP Digital Ltd - Dubai", "work_dates": "July 2007 to October 2009", "description": "•    Lead programmer on projects that involved enhancements of existing websites as well as development of new websites. Some of the projects include:     Microsites of ArabianBusiness.com (using CakePHP and Joomla)     AhlanLive.com and Masala.com (using Joomla)     TimeoutDubai.com and its sister sites (using Kohana)     ITP.net (using Kohana) •    Designed and implemented administration systems on Joomla that bridged the gap between the web editorial and the site. •    Enjoyed the responsibility to modulate and supervise tasks assigned to the team so as to ensure on time delivery of the project. •    Defined coding standards and change tracking systems. •    Coordinated with design team to create website prototypes and to solve user interface  issues. •    Also familiar with the system of e-newsletters, email marketing and web banners.", "title": "Senior Web Developer"}, {"company": "Torry Harris Business Solutions - Bengaluru, Karnataka", "work_dates": "September 2005 to April 2007", "description": "•    Lead programmer on a corporate project to upgrade a credit control system from COBOL to Java platform. •    Designed architecture including requirements definition, object modeling design and user interface definition. •    Instituted the development of design prototypes for requirement verification from clients, before the actual development phase. •    Part of a team that designed and implemented an inventory management system. •    Developed and implemented various in-house projects for project management purposes. •    Some of the projects during this period include:     CICS Migration of Serv@net Application (using Java, JSP, struts)     Inventory Management System (using PHP)     Bug Tracking System (using Java, struts)     e-VISA, online visa processing application (using PHP, WMB)", "title": "Software Engineer"}], "education": [{"school": "Rooman Institute of Technology - Coimbatore, Tamil Nadu", "title": "Diploma in Hardware", "edu_dates": "April 2005 to December 2005"}, {"school": "Bharathiar University - Coimbatore, Tamil Nadu", "title": "MSc in Software Engineering", "edu_dates": "June 2000 to April 2005"}]}, "html": "html content..", "scrap_status": "2", "_id": "5ad43e66cbc572758d39221d"}, {"url": "/r/1a80c66911ab17e3?sp=0", "parse_status": "2", "content": {"contact_info": "Samirpet, Andhra Pradesh-", "headline": "Android developer with 2.5 years of experience", "resume_title": "Android Developer", "skills": ["ANDROID (2 years)"], "work_experience": [{"company": "Ray Business Technologies - Hyderabad, Telangana", "work_dates": "September 2015 to Present", "description": "Developed automated solution for client sales team in Android, saving them from common human errors. Worked on various types of Applications. Experience in interacting with team for formulation and implementation of client requirements.", "title": "Android Developer"}, {"work_dates": "August 2017 to October 2017", "description": "Project Description: This project is developed to view live cricket scores. The User can update the profile. It has a Match calendar that shows upcoming matches.", "title": "Developer"}, {"company": "Quick Edmin", "work_dates": "March 2017 to July 2017", "description": "Project Description: This project is developed for Education Institutes to maintain their Student and Staff records. The student information like marks details, attendance details and fees can be tracked using the app. The students and teachers can view there time table. The attendance can be taken using the application.", "title": "Developer"}, {"work_dates": "September 2016 to February 2017", "description": "Project Description: The Soccer Application was developed to show the Gulf league matches. It has various modules like live match scores, team matches history, Team information, player details.", "title": "Developer"}, {"work_dates": "October 2015 to August 2016", "description": "Environment: Android SDK, Java, Sqlite Database, Eclipse. Project Description: This project is developed for the Distributers/Retailers and Merchandisers to manage their Sales, billing and maintenance requirements. It includes various modules like Store Checking, Sales Order and Return Order, Bill printing. The Application uses local database to perform operations in offline mode and sync it when the network is available.  RELEVENT EXPERIENCE RELEVENT EXPERIENCE", "title": "Developer"}], "education": [{"school": "Deccan College of Engineering & Tech.", "title": "B.E in Computer science", "edu_dates": "2013"}, {"school": "Narayana jr.College.", "title": "Class XII in Board Of Intermediate A.P", "edu_dates": "2009"}, {"school": "Kindle Care High School - Alwal, ANDHRA PRADESH, IN", "title": "Secondary School Certificate", "edu_dates": "2007"}], "additional_info": "TECHNICAL SKILLS TECHNICAL SKILLS  Languages Proficient in: Core Java, C  Familiar with: SQL, C#, Web Services: XML, JSON.  Technologies Android, Xamarin Forms  Software IDEs: Android Studio, Visual Studio, Eclipse,  Version Control Systems: GIT, SVN  Platforms: Windows XP, Windows 7, 8, 8.1, 10.  Database: SQLite"}, "html": "html content..", "scrap_status": "2", "_id": "5ad43e66cbc572758d39221e"}, {"url": "/r/297ba27715e9dd22?sp=0", "parse_status": "2", "content": {"res_summary": "• Having  3.2 years of experience in client/server Applications development using Oracle 10g/11g SQL/PLSQ Lender windows XP/ NT, UNIX environment. • Good experience in SQL (Built in Functions, Sub queries, Joins, Index Sequence), PL/SQL (Bulk Collect/Bind, Stored Procedures, Functions, Triggers, Packages and effectively using oracle built-in packages) • Good hands on using SQL * LOADER UTILITY and UTL-FILE Package. • Technically proficient in LINUX, SHELL SCRIPTING to manage Linux server • Work in Pl/SQL objects like Cursors, Procedures, and Function. • Knowledge on UNIX Commands. • Good Verbal, written and presentation skills. Excellent team worker, Self-motivated and quick learner. Adaptable to a fast growing and changing environment. • Strong  SQL and PL/SQL programming skills and Extensive experience in Oracle Back-end (server-side) PL/SQL Development i.e. Stored Procedures, Packages, Functions, Triggers, views, collections (nested tables and arrays), records, sequences, Materialized views, Constraints and other database objects using SQL and PL/SQL. • Experience in design and development of inbound interfaces integrating Oracle Apps with Legacy System using SQL*Loader. • Good Knowledge on Pragmas and Dynamic cursor. • Constructive skill in developing stored procedure, user defined function, Packages Application of cursor, run time handling of error by using Exception. • Experts in coding complex and Advanced PL/SQL program using oracle's Object oriented concept, Collections, Record types.PL/SQL Tables and Ref cursors. • Have knowledge in core java.", "contact_info": "Hyderabad, Telangana-", "headline": "Working On GI(General Insurance) Project", "resume_title": "Software Engineer", "skills": ["LINUX (Less than 1 year)", "Oracle (3 years)", "SQL (3 years)", "Pl/Sql"], "work_experience": [{"company": "Futrix Limited", "work_dates": "March 2016 to Present", "description": "Environment: Oracle 11g,  Project Description: Futrix was founded in 1997 and is based in Wellington, New Zealand.  The company also has a significant presence in the U.S., Europe, Australia and Asia.Futrix global customers receive customer support through local business partners located in those countries. In addition to health care, Futrix provides solutions for other industries including: financial services, energy, government, education, telecommunications, insurance, gaming and hospitality. ISF GENERAL covers all major insurance classes of General Insurance. It is easy to use, customizable, comprehensive and easy to implement. ISF GENERAL is designed to meet today's business challenges of General Insurance Organizations. It incorporates the functionalities of a futuristic insurance processing solution.  Responsibilities: • Creating packages, procedures, functions using advanced Pl/sql coding to implement the complex business logic. • Writing complex queries using multiple tables. • Analyzed, developed Packages, Procedures and Functions as per the requirement.  • Optimizing SQL using explain plan, Auto trace feature and TKPROF to analyze the execution plan and tune the statements. • Developed the reports through materialized views • Developed New Form as per the Client Requirement. • Prepared TSD as per the Client Requirement. • Analysis, design, develop, coding and documentation for the requirements. • Involved in writing Use cases, Unit testing  Project #1 Title: TOPUP RECHARGE Application Domain: Telecom Service", "title": "Software Engineer"}, {"company": "TELENOR", "work_dates": "January 2015 to February 2016", "description": "Modules: Defne, CVAS, Mvoucher, Recharges (Topup, Flexi topup and FRC), Stock movement, Stock allocation Environment: Oracle 11g  Project Description: Through TOPUP RECHARGE we can do recharges (Topup, Flexi Topup and FRC First recharge coupon), Stock allocation and Stock movement. TOPUP RECHARGE has deployed in different zones with the same copy and with little bit functionality change as per the client requirement. Modules in TOPUP RECHARGE: Recharges (Topup, Flexi topup and FRC), 2Stock movement, 3.Stock allocation. RECHARGE: Recharge can be done in 2 ways 1.From retailers mobile 2.From Web portal Retailer request ( Topup & Flexi Topup) When the retiler intiate recharge transaction JAVA API will capture the request and will send the request to DB (DataBase server) Two steps in Web portal  1.Subscriber validation 2.Payment proceed  Responsibilities /Contributions • Dealer interact  with ReinComputech and Telenor. GUI  For Telenor to create Dealers • Dealer user channels like STK, USSD to do the transactions • Other the dealer we have business partners EPIN vendors and also TELENOR Portal • Below are the few activities regarding dealers Recharges (Topup, Flexi topup and FRC) 3.Wallet • Validations: Dealer availability, Active/Inactive, Wallet, Circle, SSA • Stock Operation (Stock Allocation) Currently stock allocation is done by ERP people. • Move Operation (Stock Movement) Stock movement will be happen between Franchisee and Sub Franchisee • Retailer request ( Topup & Flexi Topup) TheValue Added Service are available through STK (sim tool kit), USSD andFMIS", "title": "Worked on Recharge Project"}], "education": [{"school": "Magadh University Bodh Gaya", "title": "BE"}], "additional_info": "SKILLS • ORDBMS: Oracle 9i, 10g, 11g (SQL/PLSQL), Toad • Scripting Language: LINUX Shell Scripting • Connectivity Tools: Putty6.2, Winscp for Linux Servers • Software Tools: Sql Developer, Toad and version control tool  Company Name    Designation    From Date   To Date ❑ Rein Computech  Pvt. Ltd.   Software Engineer   Dec '2014    Till Date"}, "html": "html content..", "scrap_status": "2", "_id": "5ad43e66cbc572758d39221f"}]