[{"url": "/pagead/clk?mo=r&ad=-6NYlbfkN0DFi1nmQQWK2fa3N4W3y7EUOEocZkWPqKP_f_xZ7ne8RZ-EnbSxrOnLVa6hT-nR8H5LkdX_YZ5SN0G4bCqXlunltH6Bi3V5odY5EseBI5B5IFV43_j94PrgUcU6ziO8ak1pHbLs_nQWPcFxJk2l6Q1eTEcLSRUt4qRgUijnDdahZarqdaKe-klWVW_GeyruE5jW93miNLx0rOoSU1ml3MtAMv3hN5_URaS0i190LUomeEZjUCiBipcsGvThaVoNcQILMgJRNRcNOcji8SAh9XhmgqkliQasE5HjEzqE1CcTtZDPQFaDCuX3c2o-jS8-8PObvQGvjaZhHxMQtSeiSkjMT2aI9iAVzXf8hZfV2I41L3DT1L7MAh8M88-qK2d7XOEMAj3lMLhODunriEPWPZ9rO4U_ggLWzICz0Y2ZpQwTqnLY_moqndJT8YvqhkUH49-PWboYOQSFtvTLhF31omY6br0LBOaqE-mwQVtWpqynilUo5p8jkOQYelIKg0Mhfg-RFqeFneVtXhgwvaSrskNn4c6zGB7D3q2W-C1TN1LQHg==&vjs=3&p=1&sk=&fvj=0", "parse_status": "2", "content": {"company": "Infosys", "job_title": "Java_Developer", "location": "Hyderabad, Telangana", "job_summary": "Role Designation- Technology Analyst\n\n\nResponsibilities- • Ensure effective Design, Development, Validation and Support activities in line with client needs and architectural requirements.,• Ensure continual knowledge management.,• Adherence to the organizational guidelines and processes\n\n\nTechnical and Professional Requirements- ,• Candidates working in Java/J2EE on Spring/Hibernate framework with front end or Back end development skills,• Location of posting is driven by business needs.\n\n\nEducational Requirements:\nBE , BTech , MCA\n\nService Line:\nUnit-Engineering services"}, "html": "html content..", "scrap_status": "2", "_id": "5ad4400dcbc5727aab8e851a"}, {"url": "/cmp/Infosys", "parse_status": "2", "content": {}, "html": "html content..", "scrap_status": "2", "_id": "5ad4400dcbc5727aab8e851b"}, {"url": "/pagead/clk?mo=r&ad=-6NYlbfkN0CEY_HvVara6PqymynNNmExGDiBkdNR_l4Hxk9cI3YlD5WZgjdcTn9z85S4GFiaZf99YBAOb7xALbpTE5KI43Da7Mi2MCV_i1BpUYRgs8C8fNu0xzLzSqU8cjnmPNxORKp-XjJ4E6qHCK0_Os-BAgJHOqV7iVsab6PlPJHldxJFiXCfYrg2Dz7piDWj9mt0dW-BApXKF_SPK9tY1DG_ms2jpBXJjRkV1J4Etcvkm97AiPBTAh5ESSaRyBNhV1H8BaJ5GDCI0IS6EATvQ0NWBtfnlDoQHGnQj9AyR_YY8qTFtUe3ruS2e41NFJTOsgcdRQGrUkJN6eD_Qxi1JmMch3nXBORXbxWenNtYf_SiubeajFsnd51L5Mpg4KMqfZKGzZ78uTVxY6uJRmwSzqY70fCHbimTBlvj8sqDEaoXimKlqBD40REGiNjTq8LZTWC3rlz2V0-KdAtQGw6YpeajVEEt06Bp8Mwie1jbYeywTwvITSVdL-abvJ-Z7ouuK140buSDyYsGKr6wxoyFmenJWUxjGfVqZ1ALwfQ=&vjs=3&p=2&sk=&fvj=0", "parse_status": "2", "content": {"company": "Mentor Graphics", "job_title": "Capital Software Engineer", "location": "Hyderabad, Telangana", "job_summary": "Mentor Graphics®, A Siemens Business is a leader in automation software for electrical and electronic industries. We enable companies to develop better products faster and more cost-effectively. Our innovative products and solutions help engineers conquer design challenges in the increasingly complex worlds of electrical, PCB and chip design.\nDivision Description\nMentor’s Global Support and Services division (GSS) deploys CAPITAL, a software suite used globally by automotive and aerospace manufacturers and wire-harness suppliers to enhance their electrical distribution system (EDS) design and manufacturing flows.\nCAPITAL is a Java-based tool that encompasses the following technologies:\nComputer Aided Design and Engineering\nRelational Database (Oracle, Postgres)\nObject Oriented Design and Development\nWindows and UNIX operating systems\nWeb-services and API’s for customer-specific integration and customization\nHighly interactive Web and tablet clients\nJob Description\nWe have multiple open positions for software developer to join our Consulting team being responsible for tailoring Capital based solutions to customer requirements. Focus is on development of customer-specific integrations and customizations utilizing Web-services and Capital’s application programming interface (API). The successful candidate will be required to work within an international team. As a software development engineer in the GSS Division of Mentor Graphics, the incumbent is required to understand, design and implement solutions for the electrical systems domain.\n1. Interact with Customer facing Consultants to transform requirements into software specifications\n2. Design, implement and test the functionality for the requirements\n3. Participate in code/design reviews\n4. Interact with co-workers and stakeholders to improve the quality of deliverables\n5. Provide support to customer facing Consultants for addressing customer issues\nJob Qualifications:\nEngineering graduate or post-graduate, preferably from CS background, with 2+ years of experience:\n1. Technically strong in Java EE, Data Structures, Object Oriented Design, Swing, FX\n2. Strong in Web Services technologies (SOAP, HTML 5, Java script)\n3. Familiarity with CSS will be a plus.\n4. Experience with PDM and/or PLM SW and exposure to Cabling would be beneficial\n5. Good appreciation of industrial software solutions and architectures\n6. Excellent analytical and problem solving abilities\n7. Ability to learn new technologies\n8. Ability to understand the electrical distribution system design and manufacturing flows/processes\n9. Highly self-motivated with an eagerness to learn and take initiatives\n10. Follow software development best practices, lifecycle and methodologies\n (e.g. Agile, System Requirements Specifications, Unit test,…)\n11. Project management skills (Lead & Senior Consultant only)\n12. Good verbal and written English communication skills"}, "html": "html content..", "scrap_status": "2", "_id": "5ad4400dcbc5727aab8e851c"}, {"url": "/cmp/Mentor-Graphics", "parse_status": "2", "content": {}, "html": "html content..", "scrap_status": "2", "_id": "5ad4400dcbc5727aab8e851d"}, {"url": "/pagead/clk?mo=r&ad=-6NYlbfkN0DGWbMxlqSnT1fiijd83xEf-YAaxqSlo08xiEbCyqV61cK1cWOUjnhxCnv4qrUgosJK93ZmBi0PpXTcRPyYOOP-56fc-ZNKUKnLwjLw_W0XRO8Z3rG6rwMnwzWuk4442nw9-bUni9kFj2MUp11kdUBfmXfRZf0o9OEEtwKQR95PCiCpB36DGcULWPOCoOm19dUOXgj-51Brf6ocZh21zzEk_MRz7U4JmDcgDCLTafRJ5A4z2BPc4v7gN49byA3u03QlNAIChaAoRDCB-axcEuzxS2DtQvSVZ1ooADMf429wYzgZ4ZYs2ct8CRlQICWbWsZQB3hllKgbuu65D1lrSqVyFSVtIET_9xuOglSKbBe5QPmL_VTLT7qc7IXpGh095BKAx4qVut4zQ8jfkEnBl8eafXVEH8om_z8ieDiNUxCcAk78VQX1eKVuhNmNTJy_rghP1uwYsIk0hA3psaKgtvODahgvT9ORXjE6gJGdZ-IZme3UFI1eFBvVSjjGy0kQg3BKn4Hkai4-81iDsMKoNhas8UsRUCaOlKYQZib5RGguX5zD0xfSFplzUwsHVgSl3iiNdhDB4arW0mJLv5YtGxtciEWoHbLb2tSn4BiEIbUhNiLAb7evxj137_1Ek0X9yIQIOOrCN0PzlisRpjaHkC4ZiHNcYUVkpxAT0a6aVK9eFIcTfiK215ooDxhNfR4LXAQV_8RMP7543JerN3OXX1H8hFUioidbgaP0dJKHs9fOovy9Lre4XyxnxLud4HtGDZeMi_YwhPqG4E3HsZV7u9xzaDx463WEwp0Svj3wx5pbZgMhqxi2NP_Na5dy37aqCBQmZU85rMXBSA1oFVdHArHMpch0wztcbNcrgnm78KLRRou4HRldktKxyRfb7kht8rCtlgTkR4KhRhi7tfhI36zQq4ngnnxwBTu_r1CWInJz7DGzRdcPXuGYnZbX5uDzCwOaYJVyxgO2w-cGh2aVlNKaFw9yp92A65uk4B90GwZ2i0GDlDwD8ubKMhzwXv-BzLALhEx6VwodSv3Eju3QX9tf&vjs=3&p=3&sk=&fvj=0", "parse_status": "2", "content": {"company": "PAREXEL International", "job_title": "Statistical Programmer Intern", "location": "Hyderabad, Telangana", "job_summary": "Experience in SAS.  Knowledge of the programming and reporting process within the Statistical Programming Department.  Knowledge of WSOPs/Guidelines/System Life Cycle methodologies, ICH-GCP and any other applicable local and international regulations such as 21 CFR Part 11 and proven practical application.  Demonstrate ability to learn new systems and function in an evolving technical environment.\n\n\nAttention to detail.  Ability to successfully work together with a (“virtual”) team (including international teams as required) as well as independently.  Work effectively in a quality-focused environment.  Effective time management in order to meet daily metrics or team objectives.\nShow commitment to and perform consistently high quality work."}, "html": "html content..", "scrap_status": "2", "_id": "5ad4400dcbc5727aab8e851e"}, {"url": "/cmp/Parexel", "parse_status": "2", "content": {}, "html": "html content..", "scrap_status": "2", "_id": "5ad4400dcbc5727aab8e851f"}, {"url": "/pagead/clk?mo=r&ad=-6NYlbfkN0BU3Zg8UxNAiz0UYtYpocDXqueHfbhQAratGEmwoEjCdmg1LUq62_hptnWB0N5IaA3P7Ei6374bkrLLA5OE4e5G8jD8hzDkG0Zaxogf0Titt2mRyixFKmfuemXJ5F1q3Bx5263GdzfSy6QqeNn65p4_FoodHJHjrbg81CFb-K4KkvwD7xKlPVkYft2BqFr8RsjoJfhRs--KcNLa1yUKGf-YhS_lMgLNV-2XeEIxZdS4yd4rUPfbOz7yhaqVrgzJfn01i-z0ztAWyWiSS7pyNtKl735ojxs424k6-Biclf-s8Q-f_AYLFTHlCvmHxGvnvjvJEJqgOdARh_jQRCCXoEWviMZ0P5WuGDcZU9VbMGJICmVGOcf6Pgw2yLC_xORJ2JOjN3y4aANNMw==&vjs=3&p=4&sk=&fvj=0", "parse_status": "2", "content": {"company": "American LegalNet Inc.", "job_title": "Application and SQL Developer - Team Lead", "location": "Hyderabad, Telangana", "job_summary": "JOB DESCRIPTION – TEAM LEAD, Application and SQL Development\n\nA leading US software solution company is starting its operations in India. The company has a suite of legal practice software products, individually or combined that allows law firms to improve the workflow necessary to support the entire litigation or filing lifecycle, and reduce the risks associated with missing dates and current content.\n\nIt is an exciting time to join this company who is looking for a seasoned Team Lead - Application and SQL Development Team based in India.\n\nTHE POSITION’S PURPOSE:\nThe Team Lead for Application and SQL Development Team serves as an integral part of both the Database team and the Software Development team. The Team Lead will be responsible for supervising the developers and their tasks and central point of contact for the US office. Application and SQL Development Team will be utilized for DB engineering tasks such as data conversions, process optimization and development (all SQL Server based). In addition, the Application and SQL Developer will be an important member of .Net based program development.\n\nESSENTIAL FUNCTIONS / MAJOR OBJECTIVES / DELIVERABLES:\nExperience in leading a highly functional team of developers.\n\nExperience in project and task management.\n\nExperience in strict deadlines and time management.\n\n\nBuild and design architecture of cloud based SAAS applications\nwrite .net programmers and application code\nconduct code reviews in C3, Javascript, SQL and other langauges.\nT-SQL: Analyze data sets and determine how information relates to an information system.\nPerform ad-hoc queries using SQL.\nOptimize queries for performance.\nSSRS: Designing and support existing reports, etc.\nSSIS: Maintain and create new packages for production systems.\nAdhere to project timelines and deliverable, effective communication of changes or disruptions to the schedule with a focus on expectation alignment.\nProven Web N-Tier application development experience.\nGathering and documenting business requirements from Clients.\nWork closely with clients to identify business needs.\nProviding production support of related systems and operations.\nIdentify business processes and develop solutions to solve problems.\n\nEDUCATIONAL QUALIFICATIONS / SKILLS / EXPERIENCE:\n\n5+ years of application programming experience using industry standard development tools.\n5+ years with SQL (T-SQL, SSRS, SSIS, SSAS)\nProficiency with C#/VB, JavaScript/HTML, JQuery, ASP.Net (Web Forms and MVC), CSS, HTML5\nExpert at creating and consuming web services using technologies such as SOAP, REST, WCF, WebAPI, Generic Handlers, etc.\nExperience with Web Services/Cloud Technologies such as Azure or AWS.\nAgile/Scrum project development.\nStrong problem-solving skills required.\nHave strong and confident communication skill set in customer support and presentation.\nHave background in engineering and reverse engineering system logic.\nBe able to work in a team environment.\nStrong Organization skill in Smart Sheet and Microsoft project necessary.\n\nThe position requires attendance in an office that company is currently setting up in India. Telecommuting not available."}, "html": "html content..", "scrap_status": "2", "_id": "5ad4400dcbc5727aab8e8520"}, {"url": "/company/FortunaPix/jobs/Mean-Stack-Developer-e68026df6c4f1895?fccid=efb821dcc73fefc6&vjs=3", "parse_status": "2", "content": {"company": "FortunaPix", "job_title": "MEAN Stack Developer", "location": "Hyderabad, Telangana", "job_summary": "Job SummaryMinimum 5 to 10 years of hands-on programming experienceExperience in Mean Stack developmentSolid experience in open source software, frameworks and server side development using Java/JEE, Spring, Hibernate, Middleware componentsVery Strong Object-oriented Analysis & Design (OOAD) skillsGood knowledge of agile software development, Domain Driven Design, Test-Driven development, Continuous Integration (DDD, TDD, CI)Strong knowledge and application of Design patterns, data structures and algorithms conceptsSolid experience in design and development of RESTful Web ServicesExperience in Angular4/5Experience in JavaScript-based build systems such as Grunt or GulpStrong JS unit testing skills using any of the popular tools like Jasmine/Karma/Mocha Experience with Styling and Responsive Design techniques using technologies such as HTML5, Bootstrap, LESS, and SASS.Experience in versioning systems like GitHub, SVN etcExperience of building hybrid mobile solutions for industry standard environments including iOS, Android using Apache Cordova or similar frameworksResponsibilities and DutiesWork with Technical architect & team lead to design & develop various components of the technology platformWork effectively with cross functional teams including product management to translate requirements to code, with test teams to troubleshoot, isolate issues and provide root cause, ensuring that the software developed is of the highest qualityDevelop re-usable frameworks/components and Proof-of-Concepts required to accelerate development processTake end to end technical ownership of modules, develop and deliver production codeTake responsibility for feature-focused unit and system testingContribute to performance and load testing procedures and issueremediation.Create server-side functionality using asynchronous, highly scalable designprinciples.Create rich web user interfaces using HTML5, CSS3, and JavaScript.Participate in architecture and design reviewsConduct code reviews, coverage & resolve bottlenecksEnsure highest quality deliverables while adopting agile developmentpracticesDebug/Troubleshoot and fix issues in production environment by workingwith all stakeholdersRequired Experience, Skills and QualificationsExperience in NodeJSExperience with distributed micro-service design principles, service orientedarchitecturesExperience of building hybrid mobile solutions for industry standardenvironments including iOS, Android and Windows Phone using Apache Cordovaor similar frameworksExperienced in AWS cloud stack- EC2, S3, EBS, RDS, SQS, SNS,ElastiCache etcExperience in building orchestration workflows, BPM tools & rules enginesExperience with Profiling Java and Performance Tuning code andapplications, preferably VisualVMKnowledge of Redux and React Native frameworkExperience in Elastic StackJob Type: Full-timeSalary: ₹0.00 /yearExperience:work: 5 years (Required)Education:Bachelor's (Required)"}, "html": "html content..", "scrap_status": "2", "_id": "5ad4400dcbc5727aab8e8521"}, {"url": "/company/we4its/jobs/Servicenow-Developer-dd4732afa193881d?fccid=fab6a3bfb9a3a35b&vjs=3", "parse_status": "2", "content": {"company": "we4its", "job_title": "ServiceNow Developer", "location": "Hyderabad, Telangana", "job_summary": "Hi all Greetings for the day!we are hiring immediate requirement for ServiceNow Developer position with 3 to 4 years experiencelocation : HyderabadInterested candidates share your profile to given mail id belowConfigure ServiceNow Discovery, Orchestration, Event Management and Cloud Mangement ITOM modules.Advanced scripting of business rules, UI Policies, Client Scripts, ACLs, Workflow Activities, etc.Solution and provide requested enhancements to existing ServiceNow applicationsWork with functional and admin teams to deliver automated workflow solutions in ServiceNow3rd party software integrations with ServiceNowFacilitate and support the rollout of new application and enhancements in ServiceNowAdvise functional and admin teams on design, development and overall ServiceNow best practices.Develop custom ServiceNow software solutions using JavaScript, PowerShell, Azure ARM API-s and ServiceNow ITOM modulesDevelop and deliver customized portal web pages in ServiceNow using JavaScriptEducation:Bachelor of Science in Computer Science or similar technical disciplineServiceNow System Administrator CertificationServiceNow Implementation Specialist Certification PreferredITIL V3 Foundation Certification preferredRequired Skill and Experience:Minimum 3+ years of JavaScript experience including usage of jQuery, Bootstrap and AngularJS frameworks; HTML experience.Minimum 3+ years of ServiceNow development, configuration and administration experience in an enterprise environment.Proven and verifiable history of analyzing business situations and working within a group environment to provide efficient and effective software solutions.Participation in the full software development life cycle: Analysis, Design, Coding, Testing and promotion into Production.Proven history of providing technical support during all phases of project delivery. This includes, but is not limited to: development of project estimates, solution design review, documentation creation and review, and peer code reviewsProven experience implementing and customizing a web architected, n-tiered enterprise application, strong experience with SaaS applicationsRelational database expertise in relation to an enterprise software system (Oracle, MS SQL, MySQL, etc.)Knowledge of system design and development used within Service Oriented architecture and web services integration (REST, SOAP, WSDL, JAXWS)Strong knowledge of PowerShell and Web 2.0 Technologies (Java Scripting, XML, HTML, AJAX, Jelly, CSS, PERL scripting, etc.)Demonstrated experience with ServiceNow integration using LDAP, MS Active Directory, ADFS, Single Sign-on and web services integrations.Integration (interfacing) of enterprise software systems with ServiceNowStrong knowledge of ITIL v3 methodologies, ITSM concepts, enterprise IT architecture, relational databases, ITIL certifications a plus.Strong working knowledge of ServiceNow components such as Service Catalog, Change/Incident/Problem Management, Asset Management, CMDB, Knowledge, Release Management, etc.Experience working in and managing multiple update sets and coordinating their promotion throughout multiple instances.Excellent knowledge of ServiceNow Best Practices and ongoing knowledge of latest ServiceNow features.Must have experience in multi-domain ServiceNow implementations and have developed custom applicationsMust be adaptable to work in a varied, fast paced exciting, ever changing environmentExcellent communication skills and the ability to work with business partnersGood analytical and problem solving skills to resolve technical issuesDemonstrated knowledge of AWS and Azure is a strong pluspurnasri.tummala@we4its,comJob Type: Full-time"}, "html": "html content..", "scrap_status": "2", "_id": "5ad4400dcbc5727aab8e8522"}, {"url": "/company/Prodesign-Technologies-India-Pvt.-Ltd./jobs/Mean-Stack-Developer-9ffacba9f0073ba5?fccid=5e8368d143b55726&vjs=3", "parse_status": "2", "content": {"company": "Prodesign Technologies India Pvt. Ltd.", "job_title": "MEAN Stack Developer", "location": "Hyderabad, Telangana", "job_summary": "Hi ,Greetings from Prodesign Technologies!!We are looking for below position.Position: Mean Stack DevelopersExperience: 4-6 YearsLocation: Hi-TechCity,Hyderabad.Responsibilities :Should have at least 4 -6 Years of Experience in MEAN DevelopmentMust have good knowledge on programming concepts like MongoDB, Express, AngularJS, NodeJS.Completed end-to-end execution of a web applicationWorking knowledge Linux PlatformsSoftware programming and back-end knowledgeAbility to pick up new technologies rapidly and to convert specs to low level designStrong verbal and written communication skillsYour Quick response is highly appreciated.Thanks & Regards,Zeeshan+91 8340906773 ;Pro Design Technologies India PVT LTDJob Type: Full-timeExperience:work: 3 years (Required)Education:High school or equivalent (Required)"}, "html": "html content..", "scrap_status": "2", "_id": "5ad4400dcbc5727aab8e8523"}]